jeremy-montoya-soap-sample.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
xmlns:cor="http://www.caqh.org/SOAP/WSDL/CORERule2.2.0.xsd">
<soap:Header>
<wsse:Security soap:mustUnderstand="true"
xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
<wsse:UsernameToken wsu:Id="UsernameToken-18430971"
xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
<wsse:Username>MoonlitProd</wsse:Username>
<wsse:Password
Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">***REDACTED-UHIN-PASSWORD***</wsse:Password>
</wsse:UsernameToken>
</wsse:Security>
</soap:Header>
<soap:Body>
<cor:COREEnvelopeRealTimeRequest>
<PayloadType>X12_270_Request_005010X279A1</PayloadType>
<ProcessingMode>RealTime</ProcessingMode>
<PayloadID>MOONLIT_EHR_6400702156_20250828</PayloadID>
<TimeStamp>2025-08-28T17:05:02.156Z</TimeStamp>
<SenderID>HT009582-001</SenderID>
<ReceiverID>HT000004-001</ReceiverID>
<CORERuleVersion>2.2.0</CORERuleVersion>
<Payload>ISA*00*          *00*          *ZZ*HT009582-001 *ZZ*HT000004-001 *250828*1705*^*00501*400702156*0*P*:~
GS*HS*HT009582-001*HT000004-001*20250828*1705*400702156*X*005010X279A1~
ST*270*0001*005010X279A1~
BHT*0022*13**20250828*1705~
HL*1**20*1~
NM1*PR*2*UTAH MEDICAID FFS*****46*HT000004-001~
HL*2*1*21*1~
NM1*1P*1*MONTOYA*JEREMY***MD*34*1275348807~
HL*3*2*22*0~
TRN*1*00702156-185943*1275348807*ELIGIBILITY~
TRN*1*1756400702156380*HT009582-001*REALTIME~
NM1*IL*1*MONTOYA*JEREMY****MI*0900412827~
DMG*D8*19840717*M~
DTP*291*RD8*20250828-20250828~
EQ*30~
SE*16*0001~
GE*1*400702156~
IEA*1*400702156~</Payload>
</cor:COREEnvelopeRealTimeRequest>
</soap:Body>
</soap:Envelope>